cats_99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE (2) LIMIT $1  [["LIMIT", 1]]
---
  def show
    @cat = Cat.find_by(params[:id])