cats_99/app/controllers/cats_controller.rb

  def index
    @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (2) LIMIT $1  [["LIMIT", 1]]

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Goldie"], ["updated_at", "2021-04-04 00:26:42.271260"], ["id", 1]]